Revit 2027 API
AnalyticalTransformerData Properties
The AnalyticalTransformerData type exposes the following members.
Properties
Name | Description
ApparentPowerRating |  The apparent power rating value of the analytical transformer.
AssignedPhasesNumber |  The number of electrical phases assigned through the distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
AssignedVoltage |  The voltage assigned through the distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
ConnectedPhases |  The electrical connected phases of the electrical analytical node to its upstream node.
(Inherited from AnalyticalDistributionNodePropertyData)
DistributionSystem |  The distribution system of the power distributable node.
(Inherited from AnalyticalPowerDistributableNodeData)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from AnalyticalDistributionNodePropertyData)
SecondaryDistributionSystem |  The secondary distribution system of the analytical transformer.
Top
See Also
Reference
AnalyticalTransformerData Class
Autodesk.Revit.DB.Electrical Namespace